{
  "comingSoon": {
    "title": "Cyprigo",
    "subtitle": "Coming Soon",
    "description": "We are working on something extraordinary. A new experience is on its way to you.",
    "stayTuned": "Stay tuned"
  },
  "privacyPolicy": {
    "title": "Privacy Policy",
    "appName": "Cyprigo",
    "lastUpdated": "Last Updated",
    "effectiveDate": "December 2025",
    "intro": "Please read this privacy policy carefully before using Cyprigo.",
    "sections": [
      {
        "title": "1. Introduction",
        "content": "At Cyprigo (\"we\", \"us\", or the \"App\"), we respect your privacy and are committed to protecting your personal data. This Privacy Policy explains what information we collect, how we use it, and how we protect it when you use the Cyprigo mobile application.\n\nBy downloading, installing, or using this App, you agree to the practices described in this Privacy Policy."
      },
      {
        "title": "2. Information We Collect",
        "content": "Cyprigo may collect the following information:\n\n(a) Account information: Name, email address, and profile photo you provide during registration.\n\n(b) Location data: Your device location to show nearby attractions and tours (only with your explicit permission and while the app is in use).\n\n(c) Usage data: In-app interactions, viewed tours, favorites, and preferences.\n\n(d) Device information: Device model, OS version, and app version (for debugging and performance improvements).\n\n(e) Purchase information: Membership status (payment details are processed and stored by Apple; we do not have access to your payment details)."
      },
      {
        "title": "3. Community & Safety Data (User-Generated Content)",
        "content": "When you use community features, we may process additional data to prevent abuse and moderate user-generated content:\n\n• Reports: report reason, optional description, and references to the reported content\n• Blocking: records of users you block so their content is hidden from your feed\n• Moderation actions: status updates when content is reviewed and action is taken\n\nThis data helps us enforce our zero-tolerance policy and respond to safety concerns."
      },
      {
        "title": "4. How We Use Information",
        "content": "We use the collected information to:\n\n• Provide information about tourist places and tours in Northern Cyprus\n• Offer location-based recommendations and a personalized experience\n• Manage and secure your account\n• Analyze and improve app performance\n• Provide customer support\n• Comply with legal obligations\n\nImportant: Cyprigo is an information and discovery app. We do not process reservations or payments directly."
      },
      {
        "title": "5. Sharing of Information",
        "content": "We do not share your personal data with third parties except in the following cases:\n\n(a) Service providers: Trusted providers for app infrastructure (e.g., Supabase for database services).\n\n(b) Legal requirements: When required by law or in response to legal processes.\n\n(c) Business transfers: In case of a merger, sale, or transfer of company assets.\n\nWe never sell or rent your personal data to third parties for advertising or marketing purposes."
      },
      {
        "title": "6. Data Security",
        "content": "We apply industry-standard security measures to protect your data:\n\n• Secure data transfer with SSL/TLS encryption\n• Secure cloud server infrastructure\n• Access control and authorization mechanisms\n• Encrypted data storage\n• Regular security assessments\n\nWhile no method of transmission or storage is 100% secure, we take commercially reasonable measures to protect your information."
      },
      {
        "title": "7. Data Retention",
        "content": "We retain your personal data only as long as necessary for the purposes described in this policy:\n\n• Account information: While your account remains active\n• Usage data: Up to 24 months\n• Location data: Processed in real time and not stored permanently\n\nWhen you delete your account, your personal data will be permanently removed from our systems within 30 days (except where legal retention requirements apply)."
      },
      {
        "title": "8. Your Rights",
        "content": "You have the following rights regarding your personal data:\n\n• Right of access\n• Right to rectification\n• Right to deletion\n• Right to data portability\n• Right to object to certain processing activities\n\nTo exercise these rights, you can use Settings > Delete My Account in the app or email us at cyprurigo@gmail.com."
      },
      {
        "title": "9. Children's Privacy",
        "content": "Cyprigo is not intended for children under the age of 13, and we do not knowingly collect personal data from children under 13.\n\nIf you are a parent or guardian and believe your child has provided us personal data, please contact us at cyprurigo@gmail.com and we will delete such information promptly."
      },
      {
        "title": "10. Third-Party Services",
        "content": "Our app uses third-party services such as:\n\n• Supabase: Secure database and authentication services\n• Apple App Store: In-app purchase processing\n• Apple MapKit / Google Maps: Map and location services\n\nThese services have their own privacy policies. We recommend reviewing them."
      },
      {
        "title": "11. Policy Changes",
        "content": "We may update this Privacy Policy from time to time. If there are material changes:\n\n• We may notify you in the app\n• We will publish the updated policy in the app\n• We will update the \"last updated\" date\n\nYour continued use of the app after changes means you accept the updated policy."
      },
      {
        "title": "12. Contact",
        "content": "If you have questions, concerns, or requests about this Privacy Policy or our data practices, contact us:\n\nEmail: cyprurigo@gmail.com\n\nCyprigo\nNorthern Cyprus\n\nLast updated: December 2025"
      }
    ]
  },
  "common": {
    "switchLanguage": "Türkçe",
    "backToHome": "Back to Home"
  }
}
